With terraform-provider version :1.2.1 , we have to create nodes first and then reference it in pool attachment. ( https://www.terraform.io/docs/providers/bigip/r/bigip_ltm_pool_attachment.html )

I tried with below config and it works for me.

bigip version : 15.0 ,
terraform-provider version:1.2.1

terraform-provider-bigip papineni$ cat test.tf 
provider "bigip" {
  address = "x.x.x.x"
  username = "xxxx"
  password = "xxxx"
}

resource "bigip_ltm_monitor" "mon_app1-http" {
name = "/Common/mon_app1-http"
parent = "/Common/http"
send = "GET /\r\n"
timeout = "16"
interval = "5"
}

resource "bigip_ltm_pool" "p_app1-http" {
name = "/Common/p_app1-http"
load_balancing_mode = "round-robin"
monitors = ["/Common/mon_app1-http"]
allow_snat = "yes"
allow_nat = "yes"
depends_on = [bigip_ltm_monitor.mon_app1-http]
}

resource "bigip_ltm_node" "node1" {
  name             = "/Common/terraform_node1"
  address          = "192.168.30.1"
}

resource "bigip_ltm_node" "node2" {
  name             = "/Common/terraform_node2"
  address          = "192.168.40.1"
    }

resource "bigip_ltm_pool_attachment" "attach_node1" {
pool = bigip_ltm_pool.p_app1-http.name
node = "${bigip_ltm_node.node1.name}:80"
depends_on = [bigip_ltm_pool.p_app1-http]
}

resource "bigip_ltm_pool_attachment" "attach_node2" {
pool = bigip_ltm_pool.p_app1-http.name
node = "${bigip_ltm_node.node2.name}:80"
depends_on = [bigip_ltm_pool.p_app1-http]
}

resource "bigip_ltm_virtual_server" "vs_app1-http" {
pool = bigip_ltm_pool.p_app1-http.name
name = "/Common/vs_app1-http"
destination = "10.0.1.100"
port = 80
source_address_translation = "automap"
depends_on = [bigip_ltm_pool.p_app1-http]
}




terraform-provider-bigip papineni$ terraform apply
2020/06/22 22:51:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_monitor.mon_app1-http will be created
  + resource "bigip_ltm_monitor" "mon_app1-http" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = (known after apply)
      + destination    = (known after apply)
      + id             = (known after apply)
      + interval       = 5
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/mon_app1-http"
      + parent         = "/Common/http"
      + reverse        = (known after apply)
      + send           = "GET /\\r\\n"
      + time_until_up  = (known after apply)
      + timeout        = 16
      + transparent    = (known after apply)
    }

  # bigip_ltm_node.node1 will be created
  + resource "bigip_ltm_node" "node1" {
      + address          = "192.168.30.1"
      + connection_limit = (known after apply)
      + dynamic_ratio    = (known after apply)
      + id               = (known after apply)
      + monitor          = "/Common/icmp"
      + name             = "/Common/terraform_node1"
      + rate_limit       = (known after apply)
      + ratio            = (known after apply)
    }

  # bigip_ltm_node.node2 will be created
  + resource "bigip_ltm_node" "node2" {
      + address          = "192.168.40.1"
      + connection_limit = (known after apply)
      + dynamic_ratio    = (known after apply)
      + id               = (known after apply)
      + monitor          = "/Common/icmp"
      + name             = "/Common/terraform_node2"
      + rate_limit       = (known after apply)
      + ratio            = (known after apply)
    }

  # bigip_ltm_pool.p_app1-http will be created
  + resource "bigip_ltm_pool" "p_app1-http" {
      + allow_nat           = "yes"
      + allow_snat          = "yes"
      + id                  = (known after apply)
      + load_balancing_mode = "round-robin"
      + monitors            = [
          + "/Common/mon_app1-http",
        ]
      + name                = "/Common/p_app1-http"
      + reselect_tries      = (known after apply)
      + service_down_action = (known after apply)
      + slow_ramp_time      = (known after apply)
    }

  # bigip_ltm_pool_attachment.attach_node1 will be created
  + resource "bigip_ltm_pool_attachment" "attach_node1" {
      + id   = (known after apply)
      + node = "/Common/terraform_node1:80"
      + pool = "/Common/p_app1-http"
    }

  # bigip_ltm_pool_attachment.attach_node2 will be created
  + resource "bigip_ltm_pool_attachment" "attach_node2" {
      + id   = (known after apply)
      + node = "/Common/terraform_node2:80"
      + pool = "/Common/p_app1-http"
    }

  # bigip_ltm_virtual_server.vs_app1-http will be created
  + resource "bigip_ltm_virtual_server" "vs_app1-http" {
      + client_profiles              = (known after apply)
      + destination                  = "10.0.1.100"
      + fallback_persistence_profile = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = (known after apply)
      + mask                         = (known after apply)
      + name                         = "/Common/vs_app1-http"
      + persistence_profiles         = (known after apply)
      + pool                         = "/Common/p_app1-http"
      + port                         = 80
      + profiles                     = (known after apply)
      + server_profiles              = (known after apply)
      + snatpool                     = (known after apply)
      + source                       = (known after apply)
      + source_address_translation   = "automap"
      + state                        = "enabled"
      + translate_address            = (known after apply)
      + translate_port               = (known after apply)
      + vlans_enabled                = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_node.node1: Creating...
bigip_ltm_monitor.mon_app1-http: Creating...
bigip_ltm_node.node2: Creating...
bigip_ltm_node.node2: Creation complete after 2s [id=/Common/terraform_node2]
bigip_ltm_node.node1: Creation complete after 2s [id=/Common/terraform_node1]
bigip_ltm_monitor.mon_app1-http: Still creating... [10s elapsed]
bigip_ltm_monitor.mon_app1-http: Creation complete after 11s [id=/Common/mon_app1-http]
bigip_ltm_pool.p_app1-http: Creating...
bigip_ltm_pool.p_app1-http: Creation complete after 2s [id=/Common/p_app1-http]
bigip_ltm_pool_attachment.attach_node2: Creating...
bigip_ltm_pool_attachment.attach_node1: Creating...
bigip_ltm_virtual_server.vs_app1-http: Creating...
bigip_ltm_pool_attachment.attach_node1: Creation complete after 1s [id=/Common/p_app1-http-/Common/terraform_node1:80]
bigip_ltm_pool_attachment.attach_node2: Creation complete after 1s [id=/Common/p_app1-http-/Common/terraform_node2:80]
bigip_ltm_virtual_server.vs_app1-http: Creation complete after 5s [id=/Common/vs_app1-http]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.


